angledDuctImplicit_real_test/Allrun
#!/bin/sh

set -e

surfaceFeatures -dict ./system/surfaceFeatureExtractDict   
blockMesh
snappyHexMesh -overwrite
topoSet



#cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
#. $WM_PROJECT_DIR/bin/tools/RunFunctions

#runApplication blockMesh -dict $FOAM_TUTORIALS/resources/blockMesh/angledDuct
#runApplication $(getApplication)

